OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/MIMXRT1062/drivers/fsl_edma.c
void DMA13_DriverIRQHandler(void);
void DMA13_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[13]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA14_DriverIRQHandler(void);
void DMA14_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[14]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA15_DriverIRQHandler(void);
void DMA15_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[15]);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_EDMA_MODULE_CHANNEL == 16 */

/* 32 channels (No Shared) */
#if defined(FSL_FEATURE_EDMA_MODULE_CHANNEL) && (FSL_FEATURE_EDMA_MODULE_CHANNEL > 16U)

void DMA16_DriverIRQHandler(void);
void DMA16_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[16]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA17_DriverIRQHandler(void);
void DMA17_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[17]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA18_DriverIRQHandler(void);
void DMA18_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[18]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA19_DriverIRQHandler(void);
void DMA19_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[19]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA20_DriverIRQHandler(void);
void DMA20_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[20]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA21_DriverIRQHandler(void);
void DMA21_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[21]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA22_DriverIRQHandler(void);
void DMA22_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[22]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA23_DriverIRQHandler(void);
void DMA23_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[23]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA24_DriverIRQHandler(void);
void DMA24_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[24]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA25_DriverIRQHandler(void);
void DMA25_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[25]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA26_DriverIRQHandler(void);
void DMA26_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[26]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA27_DriverIRQHandler(void);
void DMA27_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[27]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA28_DriverIRQHandler(void);
void DMA28_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[28]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA29_DriverIRQHandler(void);
void DMA29_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[29]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA30_DriverIRQHandler(void);
void DMA30_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[30]);
    SDK_ISR_EXIT_BARRIER;
}

void DMA31_DriverIRQHandler(void);
void DMA31_DriverIRQHandler(void)
{
    EDMA_HandleIRQ(s_EDMAHandle[31]);
    SDK_ISR_EXIT_BARRIER;
}
#endif /* FSL_FEATURE_EDMA_MODULE_CHANNEL == 32 */

#endif /* 4/8/16/32 channels (No Shared)  */
#endif /* FSL_FEATURE_EDMA_MODULE_CHANNEL_IRQ_ENTRY_SHARED_OFFSET */
